onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ББ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ББ_КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ++ Б.И. Бондарь. 26.02.2026. Вывести на форму документа контактное лицо. 
	КонтактноеЛицо = Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
	КонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
	КонтактноеЛицо.ПутьКДанным = "Объект.ББ_КонтактноеЛицо";
	// -- Б.И. Бондарь. 26.02.2026
	
	
	// ++ Б.И. Бондарь. 26.02.2026. Вывести на форму согласованную скидку и команду пересчета по скидке.
	// Добавляем группу "Скидка" для добавления туда %скидки и кнопки пересчета.
	ГруппаСкидка = Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Элементы.ГруппаШапкаЛево);
	ГруппаСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСкидка.Заголовок = "Скидка";
	
	// Выводим на форму скидку. 
	СогласованнаяСкидка = Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Элементы.ГруппаСкидка);
	СогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	СогласованнаяСкидка.ПутьКДанным = "Объект.ББ_СогласованнаяСкидка";
	// При изменении лежит в области "Доработка конфигурации".
	СогласованнаяСкидка.УстановитьДействие("ПриИзменении", "ББ_СогласованнаяСкидкаПриИзменении");
	
	//Добавляем команду пересчета скидки.
	КомандаПересчитать = Команды.Добавить("ПересчитатьСкидку");
	КомандаПересчитать.Заголовок = "Пересчитать скидку";
	КомандаПересчитать.Действие = "ББ_КомандаПересчитать";
	
	КнопкаКоманды = Элементы.Добавить("ПересчитатьСкидку", Тип("КнопкаФормы"), Элементы.ГруппаСкидка);
	КнопкаКоманды.ИмяКоманды = "ПересчитатьСкидку";
	КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	// -- Б.И. Бондарь. 26.02.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// ++ Б.И. Бондарь. 26.02.2026. Дополнить рассчет суммы согласованной скидкой. Скидка суммируема (из ТЧ и шапки документа). 
	//В случае превышения 100% скидки, сумму установить 0 и выдать сообщение пользователю.
	
	//Старый код:
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	//Новый код
	
	СогласованнаяСкидка = Объект.ББ_СогласованнаяСкидка + ТекущиеДанные.Скидка;
	ИтоговаяСкидка = 1 - СогласованнаяСкидка / 100;
	
	//Если сумма скидок меньше 100%, считаем скидку по формуле.
	Если СогласованнаяСкидка < 100 Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * ИтоговаяСкидка;
	//Иначе устанавливаем сумму равной 0 и выводим сообщение.
	ИначеЕсли СогласованнаяСкидка >=100 Тогда
		ТекущиеДанные.Сумма = 0;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Суммарная скидка равна или превышает 100%. Сумма сделки равна 0. Проверьте возможные ошибки.");
	КонецЕсли;
	// -- Б.И. Бондарь. 26.02.2026
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти


#Область ДоработкиКонфигурации

&НаКлиенте
Процедура ББ_СогласованнаяСкидкаПриИзменении(Элемент)
	// ++ Б.И. Бондарь. 26.02.2026. Вывести на форму согласованную скидку и команду пересчета по скидке.
	// В соответствии с ТЗ добавлен автозапрос на перерасчет таблиц при изменении значения %скидки.
	Если Объект.Товары.Количество() <> 0 ИЛИ Объект.Услуги.Количество() <> 0 Тогда
		ББ_ЗадатьВопрос()
	КонецЕсли;
	// -- Б.И. Бондарь. 26.02.2026.
КонецПроцедуры

&НаКлиенте
Асинх Процедура ББ_ЗадатьВопрос() 
	
	// ++ Б.И. Бондарь. 26.02.2026. Вывести на форму согласованную скидку и команду пересчета по скидке.
	// Прописан обработчик в случае, если при изменении %скидки по запросу на перерасчет будет получен ответ "Да".
	ТекстВопроса = ?(Объект.ББ_СогласованнаяСкидка = 0, 
		"Сбросить скидку и пересчитать табличную часть на базовые цены?", 
		"Пересчитать табличную часть с учетом новой скидки?");
	Обещание = ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Результат = Ждать Обещание;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ББ_ПересчитатьСкидку();
	КонецЕсли;
	// -- Б.И. Бондарь. 26.02.2026. 
КонецПроцедуры

&НаКлиенте
Процедура ББ_КомандаПересчитать(Команда)

	// ++ Б.И. Бондарь. 26.02.2026. Вывести на форму согласованную скидку и команду пересчета по скидке.
	// Прописан обработчик события нажатия на кнопку "Пересчитать скидку".
	ББ_ПересчитатьСкидку();
	// -- Б.И. Бондарь. 26.02.2026. 
	
КонецПроцедуры

&НаКлиенте
Процедура ББ_ПересчитатьСкидку()
	
	// ++ Б.И. Бондарь. 26.02.2026. Вывести на форму согласованную скидку и команду пересчета по скидке.
	// Обработчки события нажатия на кнопку пересчета скидки или согласия на пересчет скидки при изменении %скидки. 
	Для каждого Строка Из Объект.Товары Цикл
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;
	
	Для каждого Строка Из Объект.Услуги Цикл
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;

	РассчитатьСуммуДокумента();
	// --Б.И. Бондарь. 26.02.2026. 
	
КонецПроцедуры

#КонецОбласти
